# Assignment on Store_sales dataset

**Load the Dataset**

In [3]:
import pandas as pd
import numpy as np
df = pd.read_csv('store_sales.csv')
print(df.head())
print(df.info())

  store_id        city  Jan  Feb  Mar  Apr  May  Jun  July  Aug  Sep  Oct  \
0      S_1       Texas    8   20   13   21   17   20    24   17   16    9
1      S_2  California   12   19   15   15   11   19     7   15   10   11
2      S_3  California   16   16   14   19   23    6    13   13   15   14
3      S_4       Texas    8   18   13   10   14   14     6    8    8   18
4      S_5       Texas   19    5   24    9    5   24    10    5   24   15

   Nov  Dec
0    7    6
1   21   19
2   24    8
3    7   11
4    6   13
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   store_id  100 non-null    object
 1   city      100 non-null    object
 2   Jan       100 non-null    int64
 3   Feb       100 non-null    int64
 4   Mar       100 non-null    int64
 5   Apr       100 non-null    int64
 6   May       100 non-null    int64
 7   Jun       100 non-null    int64
 8   July      100 non-null    int64
 9   Aug       100 non-null    int64
 10  Sep       100 non-null    int64
 11  Oct       100 non-null    int64
 12  Nov       100 non-null    int64
 13  Dec       100 non-null    int64
dtypes: int64(12), object(2)
memory usage: 11.1+ KB
None

**Calculate the total sales for each store across all months.**

In [11]:
df['total Sales'] = df.iloc[:, 2:].sum(axis=1)
print(df[['store_id','total Sales']])

   store_id  total Sales
0       S_1          356
1       S_2          348
2       S_3          362
3       S_4          270
4       S_5          318
..      ...          ...
95     S_96          370
96     S_97          308
97     S_98          336
98     S_99          346
99    S_100          360

[100 rows x 2 columns]

**Find the average sales for each month across all stores**

In [ ]:

average_sales_by_month = df.iloc[:, 2:-3].mean()
average_sales_by_month

Jan     14.46
Feb     15.09
Mar     14.56
Apr     14.57
May     13.56
Jun     13.80
July    14.38
Aug     15.81
Sep     14.91
Oct     14.10
Nov     15.31
Dec     13.57
dtype: float64

**Identify the store with the highest total sales.**

In [ ]:
highest_sales_store = df.loc[df['total Sales'].idxmax()]
highest_sales_store

store_id                S_62
city              California
Jan                       16
Feb                       21
Mar                        6
Apr                       22
May                       22
Jun                        9
July                      21
Aug                       21
Sep                       22
Oct                       17
Nov                       16
Dec                       21
total Sales            214.0
aaverage sales     17.545455
average sales      17.545455
Name: 61, dtype: object

**Calculate the total sales for each city.**

In [17]:
m = df.groupby('city')['total Sales'].sum()
m

city
Arizona       15804
California    30088
Texas         23756
Name: total Sales, dtype: int64

**List stores with total sales greater than 200**

In [13]:

s = df[df['total Sales'] > 200]
print(s[['store_id', 'total Sales']])

   store_id  total Sales
0       S_1          712
1       S_2          696
2       S_3          724
3       S_4          540
4       S_5          636
..      ...          ...
95     S_96          740
96     S_97          616
97     S_98          672
98     S_99          692
99    S_100          720

[100 rows x 2 columns]

**Which month had the highest average sales across all stores?**

In [29]:
av = df.iloc[:,2:-3].mean()
av.idxmax()

'Aug'

**Which city generated the most revenue?**

In [28]:
m = df.groupby('city')['total Sales'].sum()
m.idxmax()

'California'